# 2. Напишите программу, которая на вход принимает 5 чисел и находит максимальное из них.

# list = [1, 2, 3, 4, 6, 8]
# maxn = max(list)


#list = [1,2,3,4,6,13]
#maxn = max(list)

#print (maxn)

# Показать первую цифру дробной части числа
#def FirstNumber(number):
#    bof = int((number * 10) % 10)
#    print(bof)
#FirstNumber(489.19)

# Дано число. Проверить кратно ли оно 5 и 10 или 15 но не 30

#n = 34
#if ((n % 5 == 0) and (n % 10 == 0)) or ((n % 15 == 0) and (n % 30 != 0)):
#    print(f"{n} - Удовлетворяет условиям")
#else:
#    print(f"{n} - Не довлетворяет условиям")

# Дано число обозначающее день недели. Вывести его название и указать является ли он выходным.

#def day(n):
#    words = ['пн', 'вт', 'ср', 'чт', 'пт', 'сб', 'вс']
#    is_hol = False
#    if (n == 5 or n==6):
#        is_hol = True

#    print(f)

#def int(a):
#    day = ["понедельник", "вторник", "среда", "четверг", "пятница", "суббота", "воскресенье"]
#    if ((a == 5) or (a == 6)):
#        print(f"{day[a-1]}"," - Выходной")
#    else:
#        print(f"{day[a-1]}")
#int(4)

# Проверить истинность утверждения ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат

# Сообщить в какой четверти координатной плоскости или на какой оси находится точка с координатами Х и У 

# Указав номер четверти прямоугольной системы координат, показать допустимые значения координат для точек этой четверти

# Найти расстояние между двумя точками пространства
